// Напишіть код, який перевіряє (за допомогою тернарного оператору), // чи введене користувачем значення є парним числом і виводить // відповідне повідомлення на екран за допомогою alert. // Вводити значення користувач буде за допомогою prompt()


// Напишіть код, який перевіряє, чи введене користувачем значення є рядком // і не містить символ $. Якщо це так, виведіть кількість символів у рядку. // Якщо значення не є рядком, виведіть повідомлення про невірний ввід. // Вводити значення користувач буде за допомогою prompt()


// const answer = prompt("Введіть число"); // console.log(answer); // const numbValue = Number(answer); // console.log(numbValue); // if (isNaN(numbValue)) { alert("Невалідне значення") } // else { const sqNumb = Math.pow(numbValue, 2) //     alert(Результат обчислень ${sqNumb} ) // }


// Напишіть код, який перевіряє, чи є введене користувачем значення // числом, і виводить його квадрат, якщо це число.Якщо значення // не є числом, виведіть повідомлення про невірний ввід. // Вводити значення користувач буде за допомогою prompt()


// Напишіть код, який перевіряє, чи можна відкрити двері. // Двері можна відкрити, якщо ключ у власника або у його // друга, або двері не закриті на замок.



// Напишіть код, який перевіряє, чи можна отримати водійські права. // Користувач може отримати водійські права, якщо йому виповнилося // 18 років і він має право на працевлаштування.

// Напишіть код, який перевіряє, чи користувач має право на знижку // на товар.Користувач має право на знижку, якщо він є студентом // або пенсіонером, або вік його між 12 і 18 роками(включно).


// За допомогою циклу for потрібно виконати // підрахунок кількості символів в рядку   const str = "Hello, world!";


//3. Напишіть цикл (for), який виведе в консоль усі парні числа від max до min включно по зменшенню const max = 50; const min = 23;

//4. За допомогою циклу for знайдіть суму усіх парних чисел у проміжку від min до max включно const max = 50; const min = 0;

// За допомогою циклу do...while написати програму, яка буде запитувати // користувача ввести пароль доти, доки він не введе вірний пароль.